app/controllers/auctions_controller.rb

SELECT * FROM "auctions"
---
  def index
    @auctions = Auction.all

SELECT * FROM "auctions" WHERE ("auctions"."id" = 1)
---
  def show
    @auction = Auction.find(params[:id])

INSERT INTO "auctions" ("end_time", "autobid_limit", "current_limit", "created_at", "title", "featured", "delivery_information", "peak_only", "closed", "updated_at", "minimum_price", "time_extended", "rrp", "start_price", "autobid", "meta_description", "meta_keywords", "category_id", "delivery_cost", "winner_id", "description", "extend_enabled", "status_id", "time_before_extended", "start_time", "fixed_price") VALUES('2010-06-24 04:45:00', NULL, NULL, '2010-06-24 04:49:00', 'Nintendo Wii Gaming Console with Wii Sports Resort - Black', 'f', 'Within 14 days in the original packaging', 'f', 'f', '2010-06-24 04:49:00', NULL, NULL, NULL, NULL, 'f', '', '', NULL, 19.99, NULL, '', 'f', NULL, NULL, '2010-06-24 04:45:00', NULL)
---
  def create
    @auction = Auction.new(params[:auction])
    if @auction.save